examples/urbanclimate/templates/streetCanyon_CFDHAM_grass/system/air/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (0 0 0)
  (50 0 0)
  (60 0 0)
  (70 0 0)
  (80 0 0)
  (230 0 0)
  (0 100 0)
  (50 100 0)
  (60 100 0)
  (70 100 0)
  (80 100 0)
  (230 100 0)
  (0 150 0)
  (50 150 0)
  (60 150 0)
  (70 150 0)
  (80 150 0)
  (230 150 0)
  (0 250 0)
  (50 250 0)
  (60 250 0)
  (70 250 0)
  (80 250 0)
  (230 250 0)
  (0 0 10)
  (50 0 10)
  (60 0 10)
  (70 0 10)
  (80 0 10)
  (230 0 10)
  (0 100 10)
  (50 100 10)
  (60 100 10)
  (70 100 10)
  (80 100 10)
  (230 100 10)
  (0 150 10)
  (50 150 10)
  (60 150 10)
  (70 150 10)
  (80 150 10)
  (230 150 10)
  (0 250 10)
  (50 250 10)
  (60 250 10)
  (70 250 10)
  (80 250 10)
  (230 250 10)
  (0 0 60)
  (50 0 60)
  (60 0 60)
  (70 0 60)
  (80 0 60)
  (230 0 60)
  (0 100 60)
  (50 100 60)
  (60 100 60)
  (70 100 60)
  (80 100 60)
  (230 100 60)
  (0 150 60)
  (50 150 60)
  (60 150 60)
  (70 150 60)
  (80 150 60)
  (230 150 60)
  (0 250 60)
  (50 250 60)
  (60 250 60)
  (70 250 60)
  (80 250 60)
  (230 250 60)
);
 
blocks
(
  hex (0 1 7 6 24 25 31 30) (30 37 34) simpleGrading (1.45500688749335E-02 7.89135349905273E-03 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (1 2 8 7 25 26 32 31) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (2 3 9 8 26 27 33 32) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (3 4 10 9 27 28 34 33) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (4 5 11 10 28 29 35 34) (29 37 34) simpleGrading (273.164007479249 7.89135349905273E-03 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (6 7 13 12 30 31 37 36) (30 52 34) simpleGrading (1.45500688749335E-02 ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (8 9 15 14 32 33 39 38) (34 52 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (10 11 17 16 34 35 41 40) (29 52 34) simpleGrading (273.164007479249 ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (12 13 19 18 36 37 43 42) (30 37 34) simpleGrading (1.45500688749335E-02 126.72097375862 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (13 14 20 19 37 38 44 43) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (14 15 21 20 38 39 45 44) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (15 16 22 21 39 40 46 45) (34 37 34) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (16 17 23 22 40 41 47 46) (29 37 34) simpleGrading (273.164007479249 126.72097375862 ( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) )) 
  hex (24 25 31 30 48 49 55 54) (30 37 30) simpleGrading (1.45500688749335E-02 7.89135349905273E-03 68.7281970039126) 
  hex (25 26 32 31 49 50 56 55) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 68.7281970039126) 
  hex (26 27 33 32 50 51 57 56) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 68.7281970039126) 
  hex (27 28 34 33 51 52 58 57) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 7.89135349905273E-03 68.7281970039126) 
  hex (28 29 35 34 52 53 59 58) (29 37 30) simpleGrading (273.164007479249 7.89135349905273E-03 68.7281970039126) 
  hex (30 31 37 36 54 55 61 60) (30 52 30) simpleGrading (1.45500688749335E-02 ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) 68.7281970039126) 
  hex (31 32 38 37 55 56 62 61) (34 52 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) 68.7281970039126) 
  hex (32 33 39 38 56 57 63 62) (34 52 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) 68.7281970039126) 
  hex (33 34 40 39 57 58 64 63) (34 52 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) 68.7281970039126) 
  hex (34 35 41 40 58 59 65 64) (29 52 30) simpleGrading (273.164007479249 ( (0.5 0.5 33.6747785419985) (0.5 0.5 2.96958151856239E-02) ) 68.7281970039126) 
  hex (36 37 43 42 60 61 67 66) (30 37 30) simpleGrading (1.45500688749335E-02 126.72097375862 68.7281970039126) 
  hex (37 38 44 43 61 62 68 67) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 68.7281970039126) 
  hex (38 39 45 44 62 63 69 68) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 68.7281970039126) 
  hex (39 40 46 45 63 64 70 69) (34 37 30) simpleGrading (( (0.5 0.5 6.34321679385097) (0.5 0.5 0.157648718702061) ) 126.72097375862 68.7281970039126) 
  hex (40 41 47 46 64 65 71 70) (29 37 30) simpleGrading (273.164007479249 126.72097375862 68.7281970039126) 
);
 
edges
(
);
 
boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 24 30 6)
            (6 30 36 12)
            (12 36 42 18)
            (24 48 54 30)
            (30 54 60 36)
            (36 60 66 42)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 29 35 11)
            (11 35 41 17)
            (17 41 47 23)
            (29 53 59 35)
            (35 59 65 41)
            (41 65 71 47)
        );
    }
    
    top
    {
        type patch;
        faces
        (
            (48 49 55 54)
            (49 50 56 55)
            (50 51 57 56)
            (51 52 58 57)
            (52 53 59 58)
            (54 55 61 60)
            (55 56 62 61)
            (56 57 63 62)
            (57 58 64 63)
            (58 59 65 64)
            (60 61 67 66)
            (61 62 68 67)
            (62 63 69 68)
            (63 64 70 69)
            (64 65 71 70)
        );
    }
    
    ground
    {
        type wall;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
            (2 3 9 8)
            (3 4 10 9)
            (4 5 11 10)
            (6 7 13 12)
            (10 11 17 16)
            (12 13 19 18)
            (13 14 20 19)
            (14 15 21 20)
            (15 16 22 21)
            (16 17 23 22)
        );
    }
    
    air_to_street
    {
        type wall;
        faces
        (      
            (8 9 15 14)
        );
    }
    
    air_to_windward
    {
        type wall;
        faces
        (
            (9 15 39 33) 
        );
    }
    
    air_to_leeward
    {
        type wall;
        faces
        (
            (8 14 38 32)
        );
    }
    
    side1
    {
        type patch;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
            (3 4 28 27)
            (4 5 29 28)
            (24 25 49 48)
            (25 26 50 49)
            (26 27 51 50)
            (27 28 52 51)
            (28 29 53 52)
        );
    }
    
    side2
    {
        type patch;
        faces
        (    
            (18 19 43 42)
            (19 20 44 43)
            (20 21 45 44)
            (21 22 46 45)
            (22 23 47 46)
            (42 43 67 66)
            (43 44 68 67)
            (44 45 69 68)
            (45 46 70 69)
            (46 47 71 70)
        );
    }
    
);
 
mergePatchPairs
(
);

// ************************************************************************* //
