examples/urbanclimate/templates/streetCanyon_CFDHAM_grass/constant/IDN
(
( 0 0 )
( 3600 0 )
( 7200 0 )
( 10800 0 )
( 14400 0 )
( 18000 39.6313696684973 )
( 21600 426.648046551106 )
( 25200 635.274602195092 )
( 28800 742.703353938542 )
( 32400 803.438263599227 )
( 36000 839.09596099618 )
( 39600 859.210136913615 )
( 43200 868.183855842073 )
( 46800 867.764220533819 )
( 50400 857.872456789 )
( 54000 836.56847704308 )
( 57600 799.118996088052 )
( 61200 735.282218114877 )
( 64800 621.633886776515 )
( 68400 398.69101514532 )
( 72000 15.3402501019625 )
( 75600 0 )
( 79200 0 )
( 82800 0 )
( 86400 0 )
)
