examples/urbanclimate/templates/streetCanyon_CFDHAM_grass/constant/sunPosVector
(
( 0 ( -0.1088158501 0.9397063036 -0.3242085343 ) )
( 3600 ( 0.1306587458 0.9375906617 -0.3222608312 ) )
( 7200 ( 0.361229164 0.8899477701 -0.278399816 ) )
( 10800 ( 0.5671824117 0.8000244133 -0.1956145442 ) )
( 14400 ( 0.7344831154 0.6739487195 -0.0795466954 ) )
( 18000 ( 0.8517300085 0.5203125387 0.0618938984 ) )
( 21600 ( 0.9109329091 0.3495859228 0.2190682944 ) )
( 25200 ( 0.9080572374 0.1734036087 0.3812653173 ) )
( 28800 ( 0.8432989655 0.0037721297 0.537431508 ) )
( 32400 ( 0.7210712628 -0.1477484091 0.6769243987 ) )
( 36000 ( 0.5497037451 -0.2708321334 0.7902377795 ) )
( 39600 ( 0.3408748256 -0.3570910908 0.8696495306 ) )
( 43200 ( 0.1088158501 -0.4006468759 0.9097478725 ) )
( 46800 ( -0.1306587458 -0.3985312339 0.9078001695 ) )
( 50400 ( -0.361229164 -0.3508883424 0.8639391542 ) )
( 54000 ( -0.5671824117 -0.2609649856 0.7811538825 ) )
( 57600 ( -0.7344831154 -0.1348892917 0.6650860337 ) )
( 61200 ( -0.8517300085 0.018746889 0.5236454399 ) )
( 64800 ( -0.9109329091 0.1894735049 0.3664710439 ) )
( 68400 ( -0.9080572374 0.3656558191 0.204274021 ) )
( 72000 ( -0.8432989655 0.535287298 0.0481078303 ) )
( 75600 ( -0.7210712628 0.6868078368 -0.0913850605 ) )
( 79200 ( -0.5497037451 0.8098915611 -0.2046984412 ) )
( 82800 ( -0.3408748256 0.8961505185 -0.2841101924 ) )
( 86400 ( -0.1088158501 0.9397063036 -0.3242085343 ) )
)
