examples/urbanclimate/templates/streetCanyon_CFDHAM_grass/system/air/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type        limitPressure;
    p           p_rgh;

    minFactor   0.8;
    maxFactor   1.2;
}

// ************************************************************************* //
