examples/urbanclimate/templates/streetCanyon_CFDHAM_grass/system/street/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    soil;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (60.0 100.0 -2.0)(70.0 150.0 0);
        }
    }
    {
        name    soil;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set    soil;
        }
    }
);

// ************************************************************************* //
